{
  "word2id": {
    "<PAD>": 0,
    "<START>": 1,
    "<END>": 2,
    "<UNK>": 3,
    "你": 4,
    "好": 5,
    "有": 6,
    "什": 7,
    "么": 8,
    "我": 9,
    "可": 10,
    "以": 11,
    "帮": 12,
    "助": 13,
    "的": 14,
    "吗": 15,
    "hello": 16,
    "!": 17,
    "howcanihelpyou": 18,
    "?": 19,
    "是": 20,
    "physmol": 21,
    "一": 22,
    "个": 23,
    "基": 24,
    "于": 25,
    "物": 26,
    "理": 27,
    "认": 28,
    "知": 29,
    "智": 30,
    "能": 31,
    "系": 32,
    "统": 33,
    "因": 34,
    "为": 35,
    "重": 36,
    "力": 37,
    "作": 38,
    "用": 39,
    "体": 40,
    "受": 41,
    "到": 42,
    "向": 43,
    "下": 44,
    "弹": 45,
    "性": 46,
    "材": 47,
    "料": 48,
    "在": 49,
    "变": 50,
    "形": 51,
    "后": 52,
    "恢": 53,
    "复": 54,
    "原": 55,
    "状": 56,
    "更": 57,
    "球": 58,
    "惯": 59,
    "大": 60,
    "难": 61,
    "加": 62,
    "速": 63,
    "但": 64,
    "落": 65,
    "度": 66,
    "相": 67,
    "同": 68,
    "快": 69,
    "排": 70,
    "序": 71,
    "种": 72,
    "分": 73,
    "治": 74,
    "算": 75,
    "法": 76,
    "选": 77,
    "择": 78,
    "准": 79,
    "元": 80,
    "素": 81,
    "区": 82,
    "递": 83,
    "归": 84,
    "二": 85,
    "查": 86,
    "找": 87,
    "数": 88,
    "组": 89,
    "中": 90,
    "反": 91,
    "将": 92,
    "搜": 93,
    "索": 94,
    "间": 95,
    "减": 96,
    "半": 97,
    "时": 98,
    "杂": 99,
    "ologn": 100,
    "bfs": 101,
    "队": 102,
    "列": 103,
    "逐": 104,
    "层": 105,
    "遍": 106,
    "历": 107,
    "最": 108,
    "短": 109,
    "路": 110,
    "径": 111,
    "dfs": 112,
    "栈": 113,
    "深": 114,
    "入": 115,
    "适": 116,
    "合": 117,
    "解": 118,
    "释": 119,
    "概": 120,
    "念": 121,
    "生": 122,
    "成": 123,
    "代": 124,
    "码": 125,
    "回": 126,
    "答": 127,
    "问": 128,
    "题": 129,
    "并": 130,
    "且": 131,
    "不": 132,
    "断": 133,
    "学": 134,
    "习": 135,
    "新": 136,
    "识": 137,
    "客": 138,
    "气": 139,
    "如": 140,
    "果": 141,
    "还": 142,
    "随": 143,
    "再": 144,
    "见": 145,
    "期": 146,
    "待": 147,
    "次": 148,
    "交": 149,
    "流": 150
  }
}